testdata/requests/ews_resolvenames_davmail.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
    <soap:Header><t:RequestServerVersion Version="Exchange2013_SP1"/></soap:Header>
    <soap:Body>
        <m:ResolveNames ReturnFullContactData="true" SearchScope="ActiveDirectory">
            <m:UnresolvedEntry>12345</m:UnresolvedEntry>
        </m:ResolveNames>
    </soap:Body>
</soap:Envelope>